# Data Frame dan Data Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
label = ['satu', 'dua', 'tiga']

In [3]:
angka = [10,20,30]

Ini numpy tanpa indeks pada tampilan tapi sebenarnya dia sudah terindeks

In [4]:
np_angka = np.array(angka)

In [5]:
np_angka

array([10, 20, 30])

Kita lakukan dictionary

pandas dia sudah terindekskan atau bisa dikasi dengan indeks menggunakan label yakni dengan menuliskan index= label yang diindekskan

In [6]:
d = {'satu': 10, 'dua' :20, 'tiga': 30}

In [7]:
dataku=pd.Series(data=angka, index=label)

In [8]:
dataku

satu    10
dua     20
tiga    30
dtype: int64

In [9]:
dataku['satu']

10

Ini jika dilakukan pemanggilan menggunakan numpy yakni dengan menuliskan np_NamaData [input indeks]

In [10]:
np_angka[0]

10

Pandas juga bisa langsung dijadikan series menggunakan dictionaries seperti berikut ini. Dengan menuliskan pd.Series(nama dictionaris). Memperlakukan key sebagai indeks dan nilai dari dictionaries sebagai nilainya

In [11]:
pd.Series(d)

satu    10
dua     20
tiga    30
dtype: int64

In [12]:
pd.Series(np_angka)

0    10
1    20
2    30
dtype: int32

In [13]:
pd.Series(angka)

0    10
1    20
2    30
dtype: int64

#### Merubah Pandas Series menjadi sebuah DataFrame

Perubahan dari series ke fram bisa dilakukan dengan 
namadata.to_frame()

In [14]:
dataku= dataku.to_frame()

In [15]:
dataku

       0
satu  10
dua   20
tiga  30

#### Menjumlahkan dua pandas series

In [16]:
d2= {'satu': 10, 'dua': 20, 'tiga': 30, 'empat': 40, 'lima': 50}

In [17]:
dataku = pd.Series(d)
dataku2 = pd.Series(d2)

In [18]:
dataku

satu    10
dua     20
tiga    30
dtype: int64

In [19]:
dataku2

satu     10
dua      20
tiga     30
empat    40
lima     50
dtype: int64

Pandas hanya bisa menjumlahkan data sesuai dengan indeksnya apabila data tersebut tidak memiliki indeks yang sama maka akan data yang dihasilkan akan menjadi NaN. Tipe data berupa interger akan berubah menjadi float

In [20]:
dataku + dataku2

dua      40.0
empat     NaN
lima      NaN
satu     20.0
tiga     60.0
dtype: float64

# DATA FRAME

In [21]:
np.random.seed(100)

In [22]:
mydata = pd.DataFrame(np.random.randn(3,5), ['A', 'B', 'C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])

In [23]:
mydata

       satu       dua      tiga     empat      lima
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721

In [24]:
mydata['dua']

A    0.342680
B    0.221180
C    0.435163
Name: dua, dtype: float64

In [25]:
type(mydata['dua'])

pandas.core.series.Series

Data diatas merupakan series. Kita juga bisa menambahkan kolom baru untuk sebuah data.

In [26]:
mydata['baru'] = mydata['empat']+ mydata ['lima']

In [27]:
mydata

       satu       dua      tiga     empat      lima      baru
A -1.749765  0.342680  1.153036 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.065506
C -0.458027  0.435163 -0.583595  0.816847  0.672721  1.489568

Selain menambahkan suatu kolom kita juga dapat menghapus suatu kolom. Menghapus kolom dengan menambkan .drop, yang perlu dicermati adalah penggunaan axisnya. axis=0 merupakan artian dari baris/index kemudian axis=1 merupakan artian dari suatu kolom

In [28]:
mydata = mydata.drop('tiga', axis=1)
mydata

       satu       dua     empat      lima      baru
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

Tanpa melakukan dataku = , kita juga bisa langsung merubah data dengan langsung memberikan perintah inplace=True

In [29]:
mydata.drop('baru', axis=1, inplace=True)
mydata

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
B  0.514219  0.221180 -0.189496  0.255001
C -0.458027  0.435163  0.816847  0.672721

Menghapus baris juga bisa dengan format axisnya= 0

In [30]:
mydata.drop('B', axis=0, inplace=True)
mydata

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
C -0.458027  0.435163  0.816847  0.672721

In [31]:
mydata.shape

(2, 4)

In [32]:
mydata_bol = mydata<0
mydata_bol

   satu    dua  empat   lima
A  True  False   True  False
C  True  False  False  False

In [33]:
mydata

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
C -0.458027  0.435163  0.816847  0.672721

In [34]:
mydata[mydata_bol]

       satu  dua     empat  lima
A -1.749765  NaN -0.252436   NaN
C -0.458027  NaN       NaN   NaN

In [35]:
dataku = pd.DataFrame(np.random.randn(3,5), ['A', 'B', 'C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])

In [36]:
dataku

       satu       dua      tiga     empat      lima
A -0.104411 -0.531280  1.029733 -0.438136 -1.118318
B  1.618982  1.541605 -0.251879 -0.842436  0.184519
C  0.937082  0.731000  1.361556 -0.326238  0.055676

In [37]:
dataku[dataku['tiga']>0]

       satu      dua      tiga     empat      lima
A -0.104411 -0.53128  1.029733 -0.438136 -1.118318
C  0.937082  0.73100  1.361556 -0.326238  0.055676

In [38]:
hasil = dataku[dataku['lima']>0]

In [39]:
hasil

       satu       dua      tiga     empat      lima
B  1.618982  1.541605 -0.251879 -0.842436  0.184519
C  0.937082  0.731000  1.361556 -0.326238  0.055676